This is the third session on basic usage of Python 3, which is focussed on general usage.

## Course Structure

### Session 3
**Introduction**
* Reading/writing to/from a file
* Data Structures
    - Series
    - DataFrame

**More with pandas**
* Dropping rows/columns
* Subseting
    - Indexing
    - Selection 
    - Filtering
* Null values
    - No of null values
    - Imputation of Null values
* Function application with mapping
    - apply function 
    - apply function wih lambda
    - map 
* Summarizing and Computing Descriptive Statistics

**Homework**

## Introduction

<font color = 'blue'> pandas contains high-level data structures and manipulation tools designed to make data
analysis fast and easy in Python. <br> pandas is built on top of NumPy and makes it easy to
use in NumPy-centric applications <font color = 'blue'>

<font color = 'blue'>
• Data structures with labeled axes supporting automatic or explicit data alignment. <br>
• Arithmetic operations and reductions (like summing across an axis) would pass 
on the metadata (axis labels).<br>
• Flexible handling of missing data.<br>
• Merge and other relational operations found in popular database databases (SQLbased,
for example)<br>
• Integrated time series functionality. <br>
• The same data structures handle both time series data and non-time series data. <br>
• Visualization<br>
<font color = 'blue'>

## Reading/writing to/from a file

In [3]:
import pandas as pd

In [4]:
file_name = "C:/Users/singhn25/Downloads/Python_Sessions/au-towns-sample.csv"
df_csv = pd.read_csv(file_name)

In [5]:
df_csv.head()

,id,town,urban_area,state_code,state,postcode,type,latitude,longitude,elevation,population,median_income,area_sq_km,local_government_area,region,time_zone
0,1,Aarons Pass,NaN,NSW,New South Wales,2850,Rural locality,-32.86328,149.80375,804,22,29900,82.764,Mid-Western Regional (Area),Central West,Australia/Sydney
1,2,Abba River,NaN,WA,Western Australia,6280,Rural locality,-33.68488,115.46334,23,68,35100,28.516,Busselton (City),Bunbury,Australia/Perth
2,3,Abbey,Busselton,WA,Western Australia,6280,Suburb,-33.66077,115.25863,7,1275,34580,2.644,Busselton (City),Bunbury,Australia/Perth
3,4,Abbeyard,NaN,VIC,Victoria,3737,Rural locality,-36.96978,146.75244,415,0,0,327.501,Alpine (Shire),Hume,Australia/Melbourne
4,5,Abbeywood,NaN,QLD,Queensland,4613,Rural locality,-26.10688,151.62880,429,23,16484,35.035,South Burnett (Regional Council),Wide Bay,Australia/Brisbane

## Data Structures

### Series

<font color = 'blue'> A Series is a one-dimensional array-like object containing an array of data (of any
NumPy data type) and an associated array of data labels, called its index. The simplest
Series is formed from only an array of data <font color = 'blue'>

In [7]:
pd.Series({'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada']})

state    [Ohio, Ohio, Ohio, Nevada, Nevada]
dtype: object

### DataFrame

<font color = 'blue'> 
A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered
collection of columns, each of which can be a different value type (numeric,
string, boolean, etc.)
<font color = 'blue'>

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2003, 2004],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [10]:
df = pd.DataFrame(data)

In [11]:
df.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [12]:
df.tail(3)

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2004  2.9

In [13]:
df.describe()

              year       pop
count     5.000000  5.000000
mean   2002.000000  2.420000
std       1.581139  0.864292
min    2000.000000  1.500000
25%    2001.000000  1.700000
50%    2002.000000  2.400000
75%    2003.000000  2.900000
max    2004.000000  3.600000

In [14]:
df['state'].value_counts()

Ohio      3
Nevada    2
Name: state, dtype: int64

In [24]:
df.columns

Index(['state_', 'year_', 'pop_'], dtype='object')

In [25]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

<font color = 'blue'>  Renaming Column <font color = 'blue'>

In [19]:
df.columns = ['state_', 'year_', 'pop_']
df

   state_  year_  pop_
0    Ohio   2000   1.5
1    Ohio   2001   1.7
2    Ohio   2002   3.6
3  Nevada   2003   2.4
4  Nevada   2004   2.9

In [22]:
df.index = list('abcde')
df

   state_  year_  pop_
a    Ohio   2000   1.5
b    Ohio   2001   1.7
c    Ohio   2002   3.6
d  Nevada   2003   2.4
e  Nevada   2004   2.9

<font color = 'blue'>  Renaming Index <font color = 'blue'>

In [31]:
df['debt'] = 'hoha'
df

   state_  year_  pop_  debt
a    Ohio   2000   1.5  hoha
b    Ohio   2001   1.7  hoha
c    Ohio   2002   3.6  hoha
d  Nevada   2003   2.4  hoha
e  Nevada   2004   2.9  hoha

In [ ]:
## Filtering

In [ ]:
df[(df['year']>2000) & (df['pop']>1.7)]

<font color = 'blue'>
  When assigning lists or arrays to a column, the value’s length must match the length
of the DataFrame
<font color = 'blue'>

In [32]:
df['range'] = range(5)
df

In [ ]:
del df['debt']
df

In [49]:
df2 = pd.DataFrame({'Name':['Aa', 'Bb', 'Cc', 'Dd','Ee','Ff'],
                    'Fav Fruit':['Apple', 'Grapes', 'Apple','Grapes', 'Apple','Grapes'],
                    'Calories':[200, 10, 150, 19, 5, 17],
                    'Hobby':['Dance', 'Music', 'Swimming', 'Music', 'Dance', 'Music'],
                   'Age':[30, 32, 45, 27, 28, 29]})
df2

  Name Fav Fruit  Calories     Hobby  Age
0   Aa     Apple       200     Dance   30
1   Bb    Grapes        10     Music   32
2   Cc     Apple       150  Swimming   45
3   Dd    Grapes        19     Music   27
4   Ee     Apple         5     Dance   28
5   Ff    Grapes        17     Music   29

In [50]:
df2.index = list('123456')
df2

  Name Fav Fruit  Calories     Hobby  Age
1   Aa     Apple       200     Dance   30
2   Bb    Grapes        10     Music   32
3   Cc     Apple       150  Swimming   45
4   Dd    Grapes        19     Music   27
5   Ee     Apple         5     Dance   28
6   Ff    Grapes        17     Music   29

### Dropping entries from an axis

<font color = 'blue'>
Dropping one or more entries from an axis is easy if you have an index array or list
without those entries.<br>
As that can require a bit of munging and set logic, the drop
method will return a new object with the indicated value or values deleted from an axis:
<font color = 'blue'>

In [47]:
df2.drop(['2'])

  Name Fav Fruit  calories     Hobby  Age
1   Aa     Apple       200     Dance   30
3   Cc     Apple       150  Swimming   45
4   Dd    Grapes        19     Music   27
5   Ee     Apple         5     Dance   28
6   Ff    Grapes        17     Music   29

In [48]:
df2.drop(['2', '3'])

  Name Fav Fruit  calories  Hobby  Age
1   Aa     Apple       200  Dance   30
4   Dd    Grapes        19  Music   27
5   Ee     Apple         5  Dance   28
6   Ff    Grapes        17  Music   29

In [51]:
df2.drop('Fav Fruit', axis = 1)

  Name  Calories     Hobby  Age
1   Aa       200     Dance   30
2   Bb        10     Music   32
3   Cc       150  Swimming   45
4   Dd        19     Music   27
5   Ee         5     Dance   28
6   Ff        17     Music   29

## Indexing, selection, and filtering

In [52]:
df2[['Name','Calories']]

  Name  Calories
1   Aa       200
2   Bb        10
3   Cc       150
4   Dd        19
5   Ee         5
6   Ff        17

In [54]:
df2.loc['2':'6','Name']

2    Bb
3    Cc
4    Dd
5    Ee
6    Ff
Name: Name, dtype: object

In [55]:
df2.iloc[1:3, 1:3]

  Fav Fruit  Calories
2    Grapes        10
3     Apple       150

In [57]:
df2[df2['Calories'] > 15]

  Name Fav Fruit  Calories     Hobby  Age
1   Aa     Apple       200     Dance   30
3   Cc     Apple       150  Swimming   45
4   Dd    Grapes        19     Music   27
6   Ff    Grapes        17     Music   29

In [58]:
df2['Calories'] > 15

1     True
2    False
3     True
4     True
5    False
6     True
Name: Calories, dtype: bool

#### Selection with Indexing

In [ ]:
df2[1:3]

## Function application and mapping

<font color = 'blue'>
Another frequent operation is applying a function on 1D arrays to each column or row.
DataFrame’s apply method does exactly this
<font color = 'blue'>

In [61]:
df2[['Calories', 'Age']].apply(lambda x: x.max() - x.min(), axis=0)

Calories    195
Age          18
dtype: int64

In [62]:
df2[['Calories', 'Age']].apply(lambda x: x.max() - x.min(), axis=1)

1    170
2     22
3    105
4      8
5     23
6     12
dtype: int64

In [63]:
df2['Calories']

1    200
2     10
3    150
4     19
5      5
6     17
Name: Calories, dtype: int64

In [64]:
df2['Calories'].apply(lambda x: x*2)

1    400
2     20
3    300
4     38
5     10
6     34
Name: Calories, dtype: int64

In [65]:
df2

  Name Fav Fruit  Calories     Hobby  Age
1   Aa     Apple       200     Dance   30
2   Bb    Grapes        10     Music   32
3   Cc     Apple       150  Swimming   45
4   Dd    Grapes        19     Music   27
5   Ee     Apple         5     Dance   28
6   Ff    Grapes        17     Music   29

In [66]:
def salary_cal(s):
    if s <= 10:
        s = s + 10
        
    return s

In [67]:
df2.apply(lambda x: salary_cal(x['Calories']), axis =1)

1    200
2     20
3    150
4     19
5     15
6     17
dtype: int64

<font color = 'blue'>
Say, If Calories is less than 5, 
I want to add 5 to the total calories but if calories is greater than 19 and age is < 35 I want to subtract 20% of calories from total calories<font color = 'blue'>

In [69]:
def calorie_cal(sal, age):
    if sal <= 5:
        sal = sal + 10
        
    if sal >=19 and age < 35:
        sal = sal - 0.2*sal

    return sal

In [71]:
df2.apply(lambda x: calorie_cal(x['Calories'], x['Age']), axis =1)

1    160.0
2     10.0
3    150.0
4     15.2
5     15.0
6     17.0
dtype: float64

In [73]:
df2['Calories_updated'] = df2.apply(lambda x: calorie_cal(x['Calories'], x['Age']), axis =1)

In [74]:
df2

  Name Fav Fruit  Calories     Hobby  Age  Calories_updated
1   Aa     Apple       200     Dance   30             160.0
2   Bb    Grapes        10     Music   32              10.0
3   Cc     Apple       150  Swimming   45             150.0
4   Dd    Grapes        19     Music   27              15.2
5   Ee     Apple         5     Dance   28              15.0
6   Ff    Grapes        17     Music   29              17.0

In [196]:
df2['Salary_updated'].astype('int')

Name
Kevin     160
Naipal     10
Steve     150
Hitesh     15
Mitash     15
Prachi     17
Name: Salary_updated, dtype: int32

In [75]:
df2 = df2.reset_index()
df2

  index Name Fav Fruit  Calories     Hobby  Age  Calories_updated
0     1   Aa     Apple       200     Dance   30             160.0
1     2   Bb    Grapes        10     Music   32              10.0
2     3   Cc     Apple       150  Swimming   45             150.0
3     4   Dd    Grapes        19     Music   27              15.2
4     5   Ee     Apple         5     Dance   28              15.0
5     6   Ff    Grapes        17     Music   29              17.0

In [76]:
df2.apply(lambda x: x['Fav Fruit'].lower(), axis =1)

0     apple
1    grapes
2     apple
3    grapes
4     apple
5    grapes
dtype: object

In [82]:
file_name = "C:/Users/singhn25/Downloads/Python_Sessions/au-towns-sample.csv"
df_csv = pd.read_csv(file_name)

In [83]:
df_csv.head()

,id,town,urban_area,state_code,state,postcode,type,latitude,longitude,elevation,population,median_income,area_sq_km,local_government_area,region,time_zone
0,1,Aarons Pass,NaN,NSW,New South Wales,2850,Rural locality,-32.86328,149.80375,804,22,29900,82.764,Mid-Western Regional (Area),Central West,Australia/Sydney
1,2,Abba River,NaN,WA,Western Australia,6280,Rural locality,-33.68488,115.46334,23,68,35100,28.516,Busselton (City),Bunbury,Australia/Perth
2,3,Abbey,Busselton,WA,Western Australia,6280,Suburb,-33.66077,115.25863,7,1275,34580,2.644,Busselton (City),Bunbury,Australia/Perth
3,4,Abbeyard,NaN,VIC,Victoria,3737,Rural locality,-36.96978,146.75244,415,0,0,327.501,Alpine (Shire),Hume,Australia/Melbourne
4,5,Abbeywood,NaN,QLD,Queensland,4613,Rural locality,-26.10688,151.62880,429,23,16484,35.035,South Burnett (Regional Council),Wide Bay,Australia/Brisbane

## NULL values - find and Impute

In [23]:
df_csv.isna().sum()

id                         0
town                       0
urban_area               335
state_code                 0
state                      0
postcode                   0
type                       0
latitude                   0
longitude                  0
elevation                  0
population                 0
median_income              0
area_sq_km                 0
local_government_area      0
region                     0
time_zone                  0
dtype: int64

In [27]:
df_csv['urban_area_updatd'] = df_csv['urban_area'].fillna('Busselton')

In [28]:
df_csv.isna().sum()

id                         0
town                       0
urban_area               335
state_code                 0
state                      0
postcode                   0
type                       0
latitude                   0
longitude                  0
elevation                  0
population                 0
median_income              0
area_sq_km                 0
local_government_area      0
region                     0
time_zone                  0
urban_area_updatd          0
dtype: int64

## Home work

<font color = 'blue'>
1. Download open source titanic dataset from: <br>
https://github.com/awesomedata/awesome-public-datasets/blob/master/Datasets/titanic.csv.zip

2. Read it using pandas
    - how to unzip file using python?
    - how to read from web in python?
3. Find descriptive statistaics- mean, median, std deviation, 25 percentile values
    - calculate 10 percentile values for each numerical column
    - does mean/median calculation takes NULLs into account?
4. Impute numerical feature (ie, Age column) NULLs with:
    - mean
    - median
5. Impute categorical feature (ie, cabin) NULLs with:
     - highest frequency category
6. Rename column- 'Name' as 'First Name'
     - Create a new column- 'Last Name'
     - Split the 'First Name' column into 2 (separated with comma) and put last name of passengers into column - 'Last Name'
<font color = 'blue'>